;;; packages.el ---                                  -*- lexical-binding: t; -*-

;; Add your packages herke
;; (package! package-name)

(package! which-key)
(package! all-the-icons-dired)
(package! annotate)
(package! dired-open)
(package! docker)
(package! docker-tramp)
(package! dockerfile-mode)
(package! exotica-theme)
(package! key-chord)
(package! mixed-pitch)
(package! peep-dired)
(package! spacemacs-theme)
(package! command-log-mode)
(package! company-fuzzy)
(package! crdt)
(package! dogears)
(package! evil-tutor)
(package! f)
(package! feature-mode)
(package! google-translate)
(package! harpoon)
(package! kubernetes)
(package! kubernetes-evil)
(package! lsp-tailwindcss)
(package! multi-line)
(package! rails-i18n)
(package! rails-routes)
(package! ruby-hash-syntax)
(package! ruby-json-to-hash)
(package! ruby-refactor)
(package! string-inflection)
(package! beacon)
(package! minimap)
(package! forge)
(package! eglot)
(package! rustic)
(package! org-bullets)
(package! org-roam)
(package! org-roam-ui)
(package! svg-tag-mode)
(package! diff-hl)
(package! corfu)
(package! org-appear)
(package! org-modern)
;; (package! olivetti)
;; (package! jetbrains-darcula-theme)
(unpin! smartparens)
